Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [286564; 287270], числа, имеющие максимальное количество различных делителей. Если таких чисел несколько, то найдите максимальное из них. Выведите количество делителей найденного числа и два наибольших делителя в порядке убывания.

В поле для текста укажите ответ. Файл с решение задачи прикрепите в соответствующее поле.

def f(x):

    d={1,x}
    
    for i in range(2,int(x**0.5)+1):
    
        if x%i==0:
        
            d.add(i)
            
            d.add(x//i)
            
    return sorted(d)
    
mx=0

for x in range(286564,287271):

    d=f(x)
    
    if len(d)>=mx:
    
        mx=len(d)
        
        c=d[:]
        
print(len(c),c[-1],c[-2])
