В Базу данных, содержащих сведения об одаренных учениках школ г. Москвы занесли данные олимпиады по математике. Ниже приведены первые пять строк таблицы. Для сохранения конфиденциальности, учащимся присвоили идентификаторы участников:

A	B	C	D

1	Номер участника	Номер школы	Класс	Баллы

2	Участник 1	38	8	55

3	Участник 2	32	9	329

4	Участник 3	30	8	252

5	Участник 4	50	8	202

В столбце A записан номер участника; в столбце B — номер школы; в столбце C — класс; в столбце D — набранные баллы. Всего в электронную таблицу были занесены данные по 1000 участникам.

Файл, содержащий таблицу БД 

Или заберите файлы по ссылке: https://github.com/pchelintseva-1581/KKR-10IT-summer.git

Выполните задание: напишите программу, обрабатывающую запросы к базе данных.

 Откройте файл с данной электронной таблицей . На основании данных, содержащихся в этой таблице, ответьте на два вопроса:
 Сколько девятиклассников набрали более 250 баллов?

f=open('10.txt')

m={}

for i in range(4):

   s=list(f.readline().split())
    
   if int(s[3]) in m:
    
   m[int(s[3])]+=[int(s[4])]
        
   else:
    
   m[int(s[3])]=[int(s[4])]
        
c=0

num=[x[1] for x in m.items() if x[0]==9]

#Берем значения из нужного ключа

for i in range(len(num)):

   p=num[i]
    
   for k in range(len(p)):
    
  if p[k]>=250:
        
  c+=1
            
  #Вычисляем кол-во из нашего ключа
            

print(c)

