Даны три строки, состоящие из строчных латинских букв. С этими строками можно производить следующие операции: либо заменить один символ строки на два таких же символа (например, заменить символ «a» на «aa»), либо, наоборот, заменить два подряд идущих одинаковых символа на один такой же символ.

Необходимо при помощи этих операций сделать все три строки равными какой-то другой общей строке S либо определить, что это сделать невозможно. При этом нужно минимизировать общее количество операций.

Входные данные

Программа получает на вход три строки, состоящие из строчных букв латинского алфавита. Длина каждой строки не превышает 100 символов.

Выходные данные

Если при помощи указанных операций возможно сделать все три строки равными, выведите такую строку S , что суммарное число операций, необходимых для преобразования всех трёх данных строк к строке S , будет минимальным. Если этого сделать нельзя, программа должна вывести одно слово IMPOSSIBLE (заглавными буквами).

Примечание

Решение, которое выводит правильный ответ только на тестах из условия и тех тестах, на которых ответом является слово IMPOSSIBLE, будет оцениваться в 0 баллов.

Примеры

входные данные

aaaza

aazzaa

azzza

выходные данные

aazza

входные данные

xy

xxyy

yx

выходные данные

IMPOSSIBLE



def f(s):

    s='#'+s
    
    u=''
    
    c=[]
    
    for i in range(1,(len(s))):
    
        if s[i]!=s[i-1]:
        
            u+=s[i]
            
            c+=[1]
            
        else:
        
            c[-1]+=1
            
    return u,c
    

def m(a,b,c):

    return a+b+c-min(a,b,c)-max(a,b,c)

s1=input()

s2=input()

s3=input()

ch1,count_1=f(s1)

ch2,count_2=f(s2)

ch3,count_3=f(s3)

if ch1==ch2==ch3:

    ans=''
    
    for i in range(len(ch1)):
    
        ans+=m(count_1[i],count_2[i],count_3[i])*ch1[i]
        
    print(ans)
    
else:

    print('IMPOSIBLE')

